ErpTest/src/InformationRegisters/пкАктТехническогоОбслуживания/пкАктТехническогоОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкАктТехническогоОбслуживания</name>
  <resources>
    <name>НаименованиеОграничителей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>CatalogRef.пкТипыОграничителейУказателей</types>
    </type>
  </resources>
  <resources>
    <name>Заключение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкАктТехническогоОбслуживания/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	
	СписокОграничителей.Очистить();
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Ограничитель предельного груза";
	НоваяСтрока.Заключение = "Исправно";
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Система ориентации пола люльки в горизонтальном положении";
	НоваяСтрока.Заключение = "Исправно";
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Система ограничения зоны обслуживания";
	НоваяСтрока.Заключение = "Исправно";
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Система аварийного опускания люльки при отказе гидросистемы, электропривода или привода гидронасоса";
	НоваяСтрока.Заключение = "Исправно";
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Устройство (указатель) углового наклона подъемника";
	НоваяСтрока.Заключение = "Исправно";
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Система аварийной установки двигателя с управлением из рабочей платформы и с нижнего пульта";
	НоваяСтрока.Заключение = "Исправно";
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Устройство блокировки движения шасси";
	НоваяСтрока.Заключение = "Исправно";
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Звуковой сигнал рабочей платформы (с нижнего пульта)";
	НоваяСтрока.Заключение = "Исправно";
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Устройство для учета в моточасах";
	НоваяСтрока.Заключение = "Исправно";
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Концевые выключатели";
	НоваяСтрока.Заключение = "Исправно";
	
	НоваяСтрока = СписокОграничителей.Добавить();
	НоваяСтрока.НомерСтроки = СписокОграничителей.Количество();
	НоваяСтрока.НаименованиеОграничителей = "Реле температурное";
	НоваяСтрока.Заключение = "Исправно";
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМоделямиБеУстановокНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	пкАктТехническогоОбслуживания.Модель
		|ПОМЕСТИТЬ ВТ_Исключения
		|ИЗ
		|	РегистрСведений.пкАктТехническогоОбслуживания КАК пкАктТехническогоОбслуживания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Модель
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Исключения КАК ВТ_Исключения
		|		ПО ВТ_Исключения.Модель = Номенклатура.Ссылка
		|ГДЕ
		|	ВТ_Исключения.Модель ЕСТЬ NULL 
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|	И Номенклатура.пкЭтоТехника = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокМоделей.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = СписокМоделей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМоделямиБеУстановок(Команда)
	ЗаполнитьМоделямиБеУстановокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()

	Для Каждого ТекМодель Из СписокМоделей Цикл
		НаборЗаписей = РегистрыСведений.пкАктТехническогоОбслуживания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Модель.Установить(ТекМодель.Модель);
		НаборЗаписей.Очистить();
		Для Каждого ТекОграничитель Из СписокОграничителей Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Модель = ТекМодель.Модель;
			НоваяЗапись.НН = ТекОграничитель.НомерСтроки;
			НоваяЗапись.НаименованиеОграничителей = ТекОграничитель.НаименованиеОграничителей;
			НоваяЗапись.Тип = ТекОграничитель.Тип;
			НоваяЗапись.Заключение = ТекОграничитель.Заключение;
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокОграничителейПриИзменении(Элемент)
	
	ПустаяСссылка = ПредопределенноеЗначение("Справочник.пкТипыОграничителейУказателей.ПустаяСсылка");
	Ном = 1;
	Для Ном = 1 По СписокОграничителей.Количество() Цикл
		Если СписокОграничителей[Ном - 1].НомерСтроки <> Ном Тогда
			СписокОграничителей[Ном - 1].НомерСтроки = Ном;
			СписокОграничителей[Ном - 1].Тип = ПустаяСссылка;
		КонецЕсли;
	КонецЦикла;	
		
	
КонецПроцедуры


&НаКлиенте
Процедура СписокОграничителейТипНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомерТекСтроки = Элементы.СписокОграничителей.ТекущиеДанные.НомерСтроки;
	
    ПараметрыФормы = Новый Структура;
    ФН = Новый НастройкиКомпоновкиДанных;
    Эл = ФН.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НомерПункта");
    Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    Эл.ПравоеЗначение = НомерТекСтроки;
    Эл.Использование = Истина;
    Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
    ПараметрыФормы.Вставить("ФиксированныеНастройки", ФН);
    ОткрытьФорму("Справочник.пкТипыОграничителейУказателей.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура СписокОграничителейТипОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	НомерТекСтроки = Элементы.СписокОграничителей.ТекущиеДанные.НомерСтроки;
	Если Не НомераСовпадают(НомерТекСтроки, ВыбранноеЗначение) Тогда
		ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.пкТипыОграничителейУказателей.ПустаяСсылка");
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выбранное Вами значение не соответствует номеру строки!";
		Сообщение.Сообщить();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция НомераСовпадают(НомерТекСтроки, ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.пкТипыОграничителейУказателей") И ВыбранноеЗначение.НомерПункта = НомерТекСтроки Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции
